/** 전역 객체 (빌트인 전역 함수) **/

// 빌트인 전역 함수는 애플리케이션 전역에서 호출할 수 있는 빌트인 함수로서 전역 객체의 메서드다.
// 해당 내용은 현업에서 크게 중요하게 쓰일 곳이 없을거 같아 카페고리만 작성 후 나중 시간이 있을 때 알아보도록 하겠습니다.

/** eval : eval 함수는 자바스크립트 코드를 나타내는 문자열 인수로 전달 받는다. **/
/** isFinite : 전달받은 인수가 정상적인 유한수인지 검사하여 유산수이면 true 를 반환하고, 무한수이면 false 를 반환한다. **/
/** isNaN : 전달받은 인수가 NaN인지 검사하여 그 결과를 불리언 타입으로 변환한다. **/
/** parseFloat : 전달받은 문자열 인수를 부동 소수점 숫자, 즉 실수로 해석하여 반환한다. **/
/** parseInt : 전달받은 문자열 인수를 정수로 해석하여 반환한다. **/
/** encodeURI : encodeURI 함수는 URI 를 문자열로 전달받아 이스케이프 처리를 위해 인코딩한다.
    decodeURI : decodeURI 함수는 인코딩된 URI 를 인수로 전달받아 이스케이프 처리 이전으로 디코딩한다.
    URI : 인터넷에 있는 자원을 나타내는 유일한 주소, URI 의 하위 개념으로 URL URN 이 있다. **/
/** encodeURIComponent : URI 구성 요소를 인수로 전달받아 인코딩 한다.
    encodeURIComponent : 매개변수로 전달된 구성요소를 디코딩 한다. **/
